In [4]:
import pandas as pd
import numpy as np
import seaborn

In [5]:
df = pd.read_csv('shop data.csv')

In [6]:
df

      age  income  gender m_status buys
0     <25    high    male   single   no
1     <25    high    male  married   no
2   25-35    high    male   single  yes
3     >35  medium    male   single  yes
4     >35     low  female   single  yes
5     >35     low  female   single   no
6   25-35     low  female  married  yes
7     <25  medium    male  married   no
8     <25     low  female   single  yes
9     >35  medium  female  married  yes
10    <25  medium  female   single  yes
11  25-35  medium    male  married  yes
12  25-35    high  female   single  yes
13    >35  medium    male  married   no
14    <25    high    male   single   no

In [7]:
df['income'].unique()

array(['high', 'medium', 'low'], dtype=object)

In [8]:
income_order = ['low','medium','high']

In [9]:
from sklearn.preprocessing import OrdinalEncoder

In [10]:
enco = OrdinalEncoder(categories= [income_order])

In [11]:
enco.fit(df[['income']])

OrdinalEncoder(categories=[['low', 'medium', 'high']])

In [12]:
final = pd.DataFrame(enco.transform(df[['income']]))

In [13]:
df['income'] = final

In [14]:
df

      age  income  gender m_status buys
0     <25     2.0    male   single   no
1     <25     2.0    male  married   no
2   25-35     2.0    male   single  yes
3     >35     1.0    male   single  yes
4     >35     0.0  female   single  yes
5     >35     0.0  female   single   no
6   25-35     0.0  female  married  yes
7     <25     1.0    male  married   no
8     <25     0.0  female   single  yes
9     >35     1.0  female  married  yes
10    <25     1.0  female   single  yes
11  25-35     1.0    male  married  yes
12  25-35     2.0  female   single  yes
13    >35     1.0    male  married   no
14    <25     2.0    male   single   no

In [15]:
from sklearn.preprocessing import LabelEncoder

In [16]:
le = LabelEncoder()

In [17]:
df['age'] = le.fit_transform(df['age'])

In [18]:
df

    age  income  gender m_status buys
0     1     2.0    male   single   no
1     1     2.0    male  married   no
2     0     2.0    male   single  yes
3     2     1.0    male   single  yes
4     2     0.0  female   single  yes
5     2     0.0  female   single   no
6     0     0.0  female  married  yes
7     1     1.0    male  married   no
8     1     0.0  female   single  yes
9     2     1.0  female  married  yes
10    1     1.0  female   single  yes
11    0     1.0    male  married  yes
12    0     2.0  female   single  yes
13    2     1.0    male  married   no
14    1     2.0    male   single   no

In [19]:
df['gender'] = le.fit_transform(df['gender'])

In [20]:
df['m_status'] = le.fit_transform(df['m_status'])

In [21]:
df

    age  income  gender  m_status buys
0     1     2.0       1         1   no
1     1     2.0       1         0   no
2     0     2.0       1         1  yes
3     2     1.0       1         1  yes
4     2     0.0       0         1  yes
5     2     0.0       0         1   no
6     0     0.0       0         0  yes
7     1     1.0       1         0   no
8     1     0.0       0         1  yes
9     2     1.0       0         0  yes
10    1     1.0       0         1  yes
11    0     1.0       1         0  yes
12    0     2.0       0         1  yes
13    2     1.0       1         0   no
14    1     2.0       1         1   no

In [22]:
x = df.drop(['buys'], axis = 1)
x

    age  income  gender  m_status
0     1     2.0       1         1
1     1     2.0       1         0
2     0     2.0       1         1
3     2     1.0       1         1
4     2     0.0       0         1
5     2     0.0       0         1
6     0     0.0       0         0
7     1     1.0       1         0
8     1     0.0       0         1
9     2     1.0       0         0
10    1     1.0       0         1
11    0     1.0       1         0
12    0     2.0       0         1
13    2     1.0       1         0
14    1     2.0       1         1

In [23]:
y = df['buys']
y

0      no
1      no
2     yes
3     yes
4     yes
5      no
6     yes
7      no
8     yes
9     yes
10    yes
11    yes
12    yes
13     no
14     no
Name: buys, dtype: object

# Data Training

In [24]:
from sklearn.model_selection import train_test_split

In [25]:
xtrain,xtest,ytrain,ytest = train_test_split(x,y, test_size=.30, random_state=1)

In [26]:
xtrain

    age  income  gender  m_status
4     2     0.0       0         1
1     1     2.0       1         0
13    2     1.0       1         0
0     1     2.0       1         1
14    1     2.0       1         1
9     2     1.0       0         0
8     1     0.0       0         1
12    0     2.0       0         1
11    0     1.0       1         0
5     2     0.0       0         1

# Random Forest Classifier

In [27]:
from sklearn.ensemble import RandomForestClassifier

In [28]:
Rfclf = RandomForestClassifier()

In [29]:
Rfclf.fit(xtrain,ytrain)

RandomForestClassifier()

In [30]:
Rfclf.score(xtest,ytest)

0.6

In [31]:
Rfclf.predict([[1,2,0,1]])

C:\Users\Hp\anaconda3\lib\site-packages\sklearn\base.py:450: UserWarning: X does not have valid feature names, but RandomForestClassifier was fitted with feature names
  warnings.warn(

array(['yes'], dtype=object)